test/performance/benchmarks/func-invocation-ego/run/single-fun-enclave-samba-sacmat/1000.log
2025/10/20 04:14:39 Function mode: SINGLE
2025/10/20 04:14:39 RSA_SK is not set, not encrypting using RSA private key
{"level":"info","ts":1760933679.689788,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/10/20 04:14:39 Starting func invocation probe for target: appender-ego
2025/10/20 04:14:39 Using rate: 1000
2025/10/20 04:20:39 Shutting down InfluxReporter
Requests      [total, rate, throughput]         299998, 1000.00, 999.92
Duration      [total, attack, wait]             5m0s, 5m0s, 23.929ms
Latencies     [min, mean, 50, 90, 95, 99, max]  14.7ms, 24.512ms, 22.004ms, 30.495ms, 38.364ms, 80.717ms, 885.653ms
Bytes In      [total, mean]                     343797708, 1146.00
Bytes Out     [total, mean]                     341697722, 1139.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:299998  
Error Set:
2025/10/20 04:20:39 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 38.363594ms